; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v7 ?v4)
             (pred_7 ?v10 ?v8)
             (pred_6 ?v7 ?v8)
             (pred_9 ?v9 ?v7 )
	     (pred_11 ?v7)
             (pred_3 ?v6)
             (pred_5 ?v10)
             (pred_2 ?v8)
             (pred_12 ?v7)
             (pred_4 ?v10)
             (pred_1 ?v7)
             (pred_10 ))



(:action op_1
:parameters (?v13 ?v5 ?v12 ?v2)
:precondition (and (pred_3 ?v13) (pred_3 ?v5) (pred_5 ?v12) (pred_2 ?v2)
          (pred_8 ?v13 ?v5) (pred_7 ?v12 ?v2)
                   (pred_6 ?v5 ?v2) (pred_11 ?v13) 
                   (pred_12 ?v5) (pred_4 ?v12))
:effect (and  (pred_1 ?v5) (not (pred_12 ?v5))))


(:action op_3
:parameters (?v13 ?v3)
:precondition (and (pred_3 ?v13) (pred_3 ?v3)
               (pred_11 ?v13) (pred_8 ?v13 ?v3) (pred_1 ?v3))
:effect (and (pred_11 ?v3) (not (pred_11 ?v13))))

(:action op_5
:parameters (?v13 ?v12)
:precondition (and (pred_3 ?v13) (pred_5 ?v12) 
                  (pred_11 ?v13) (pred_9 ?v12 ?v13) (pred_10 ))
:effect (and (pred_4 ?v12)
   (not (pred_9 ?v12 ?v13)) (not (pred_10 ))))


(:action op_2
:parameters (?v13 ?v11 ?v1)
:precondition (and (pred_3 ?v13) (pred_5 ?v11) (pred_5 ?v1)
                  (pred_11 ?v13) (pred_4 ?v1) (pred_9 ?v11 ?v13))
:effect (and (pred_4 ?v11) (pred_9 ?v1 ?v13)
        (not (pred_4 ?v1)) (not (pred_9 ?v11 ?v13))))

(:action op_4
:parameters (?v13 ?v12)
:precondition (and (pred_3 ?v13) (pred_5 ?v12) 
                  (pred_11 ?v13) (pred_4 ?v12))
:effect (and (pred_10 ) (pred_9 ?v12 ?v13) (not (pred_4 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_09 obj_15 obj_12 obj_10 obj_18 obj_05 obj_19 obj_07 obj_04 obj_16 obj_06 obj_14 obj_01 obj_11 obj_02 obj_17
    obj_03 obj_13
    obj_08 obj_20
    )

    (:init
       (pred_10)

       (pred_3 obj_09)
       (pred_3 obj_15)
       (pred_3 obj_12)
       (pred_3 obj_10)
       (pred_3 obj_18)
       (pred_3 obj_05)
       (pred_3 obj_19)
       (pred_3 obj_07)
       (pred_3 obj_04)
       (pred_3 obj_16)
       (pred_3 obj_06)
       (pred_3 obj_14)
       (pred_3 obj_01)
       (pred_3 obj_11)
       (pred_3 obj_02)
       (pred_3 obj_17)
       (pred_2 obj_03)
       (pred_2 obj_13)
       (pred_5 obj_08)
       (pred_5 obj_20)

       (pred_8 obj_09 obj_18)
       (pred_8 obj_09 obj_15)
       (pred_8 obj_15 obj_05)
       (pred_8 obj_15 obj_12)
       (pred_8 obj_15 obj_09)
       (pred_8 obj_12 obj_19)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_12 obj_15)
       (pred_8 obj_10 obj_07)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_18 obj_05)
       (pred_8 obj_18 obj_09)
       (pred_8 obj_05 obj_16)
       (pred_8 obj_05 obj_19)
       (pred_8 obj_05 obj_15)
       (pred_8 obj_05 obj_18)
       (pred_8 obj_19 obj_06)
       (pred_8 obj_19 obj_07)
       (pred_8 obj_19 obj_12)
       (pred_8 obj_19 obj_05)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_07 obj_10)
       (pred_8 obj_07 obj_19)
       (pred_8 obj_04 obj_01)
       (pred_8 obj_04 obj_16)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_16 obj_11)
       (pred_8 obj_16 obj_06)
       (pred_8 obj_16 obj_05)
       (pred_8 obj_16 obj_04)
       (pred_8 obj_06 obj_02)
       (pred_8 obj_06 obj_14)
       (pred_8 obj_06 obj_19)
       (pred_8 obj_06 obj_16)
       (pred_8 obj_14 obj_17)
       (pred_8 obj_14 obj_07)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_01 obj_11)
       (pred_8 obj_01 obj_04)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_11 obj_16)
       (pred_8 obj_11 obj_01)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_02 obj_06)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_17 obj_14)
       (pred_8 obj_17 obj_02)
       (pred_12 obj_16)
       (pred_12 obj_07)
       (pred_6  obj_16 obj_03)
       (pred_6  obj_07 obj_13)
       (pred_1 obj_09)
       (pred_1 obj_15)
       (pred_1 obj_12)
       (pred_1 obj_10)
       (pred_1 obj_18)
       (pred_1 obj_05)
       (pred_1 obj_19)
       (pred_1 obj_04)
       (pred_1 obj_06)
       (pred_1 obj_14)
       (pred_1 obj_01)
       (pred_1 obj_11)
       (pred_1 obj_02)
       (pred_1 obj_17)

       (pred_7  obj_08 obj_03)
       (pred_7  obj_20 obj_13)
       (pred_9 obj_08 obj_06)
       (pred_9 obj_20 obj_10)
       (pred_11 obj_01)
    )

    (:goal (and
       (pred_9 obj_08 obj_09)
       (pred_9 obj_20 obj_06)
    ))
(:constraints
  (always (not (pred_11 obj_19)))
)
)

; plan
1. (op_3 obj_01 obj_04)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_04)
   goals met: 0 of 2
2. (op_3 obj_04 obj_18)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_18)
   goals met: 0 of 2
3. (op_3 obj_18 obj_05)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_05)
   goals met: 0 of 2
4. (op_3 obj_05 obj_15)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_15)
   goals met: 0 of 2
5. (op_3 obj_15 obj_12)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_12)
   goals met: 0 of 2
6. (op_3 obj_12 obj_10)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_10)
   goals met: 0 of 2
7. (op_5 obj_10 obj_20)
   deleted: (pred_9 obj_20 obj_10) (pred_10)
   added: (pred_4 obj_20)
   goals met: 0 of 2
8. (op_1 obj_10 obj_07 obj_20 obj_13)
   deleted: (pred_12 obj_07)
   added: (pred_1 obj_07)
   goals met: 0 of 2
9. (op_3 obj_10 obj_07)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_07)
   goals met: 0 of 2
10. (op_3 obj_07 obj_14)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_14)
   goals met: 0 of 2
11. (op_3 obj_14 obj_06)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_06)
   goals met: 0 of 2
12. (op_2 obj_06 obj_08 obj_20)
   deleted: (pred_4 obj_20) (pred_9 obj_08 obj_06)
   added: (pred_4 obj_08) (pred_9 obj_20 obj_06)
   goals met: 1 of 2
13. (op_1 obj_06 obj_16 obj_08 obj_03)
   deleted: (pred_12 obj_16)
   added: (pred_1 obj_16)
   goals met: 1 of 2
14. (op_3 obj_06 obj_16)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_16)
   goals met: 1 of 2
15. (op_3 obj_16 obj_05)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_05)
   goals met: 1 of 2
16. (op_3 obj_05 obj_15)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_15)
   goals met: 1 of 2
17. (op_3 obj_15 obj_09)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_09)
   goals met: 1 of 2
18. (op_4 obj_09 obj_08)
   deleted: (pred_4 obj_08)
   added: (pred_10) (pred_9 obj_08 obj_09)
   goals met: 2 of 2
